# 1st program
print ("возведение числа 9 в степень 0.5, после умножение на 5:", 9 ** 0.5 * 5)
# 2nd program
print("9.99 больше 9.98 и 1000 не равно 1000.1 одновременно:", 9.99 > 9.98 and 1000 != 1000.1)
# 3rd program
print ("1234 и 5678.Выведите сумму серединных чисел исходных данных (23 и 67):", 1234%1000//10+5678%1000//10)
# 4th program
print ("13.42 и 42.13. целая часть хотя бы одного из чисел равна дробной части другого?")
print (int(13.42*100%100) == int(42.13) or int(42.13*100%100) == int(13.42))